rkuris/erik/nextgen/sdkconfig.defaults
# Target ESP32-C6 microcontroller
CONFIG_IDF_TARGET="esp32c6"

# Rust often needs a bit of an extra main task stack size compared to C (the default is 3K)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=12000

# Allow faster FreeRTOS tick for tighter timing when servicing HTTP
#CONFIG_FREERTOS_HZ=1000
